Several updates to the implement-story skill
1. Add process diagram (use mermaid for github rendering)
2. Explictly invoke gather-context skill using psuedo-code tool call syntax with a subagent-type parameter. This is to get around bug https://github.com/anthropics/claude-code/issues/16803
3. Prevent the main agent from shutdown design agents until the design PR has been approved and merged.
4. Explain the Github PR feedback protocol. Agents must reply to each comment (and indicating who they are).
